[
    {
        "headline": "Asia Cup: PCB proposes to host four games in Pakistan, remainder in UAE",
        "author": "",
        "published": 1683814680000,
        "blurb": "The Asia Cup is scheduled to be held in Pakistan in September this year, but India has declined to travel to Pakistan for the event due to political tensions between the two nations.",
        "story": "The Asia Cup is scheduled to be held in Pakistan in September this year, but India has declined to travel to Pakistan for the event due to political tensions between the two nations.To resolve the issue, Pakistan proposed a hybrid model during an Asian Cricket Council meeting, under which all teams would play in Pakistan except for India, who would play their matches at a neutral venue. However, India has also rejected this proposal and is now pushing for the entire tournament to take place at a neutral location.",
        "topic": "news",
        "id": "618d881b5e0037278418a2e9f8b2c63b"
    },
    {
        "headline": "Australian bushfires may have helped trigger La Nina",
        "author": "eNCA",
        "published": 1683814680000,
        "blurb": "Australia's 'Black Summer' bushfire catastrophe coughed up so much smoke it may have fuelled the global onset of La Nina in 2020, according to new research published Thursday.",
        "story": "Australia's 'Black Summer' bushfire catastrophe coughed up so much smoke it may have fuelled the global onset of La Nina in 2020, according to new research published Thursday. The research found the Australian bushfires of 2019 and 2020 pumped out emissions on a scale similar to major volcanic eruptions AFP | PETER PARKS SYDNEY - Australia's\"Black Summer\" bushfire catastrophe coughed up so much smoke it may have fuelled...The research found the Australian bushfires of 2019 and 2020 pumped out emissions on a scale similar to major volcanic eruptions AFP | PETER PARKS SYDNEY - Australia's\"Black Summer\" bushfire catastrophe coughed up so much smoke it may have fuelled the global onset of La Nina in 2020, according to new research published Thursday.",
        "topic": "news",
        "id": "14d9a2e7a292c296dd867911c04bec42"
    },
    {
        "headline": "Dinosaur Isle's future, dementia care and planning enforcement all discussed TONIGHT",
        "author": "ter",
        "published": 1683814649000,
        "blurb": "The future of Dinosaur Isle is among the hot topics on the Isle of Wight Council's cabinet agenda for tonight's (Thursday) meeting.",
        "story": "Dinosaur Isle's future, dementia care and planning enforcement all discussed TONIGHT (Image: quest) The future of Dinosaur Isle is among the hot topics on the Isle of Wight Council's cabinet agenda for tonight's (Thursday) meeting. The tourist attraction, on Culver Parade, has been losing the authority money, and with more urgent repair works needed to the building, the council is looking for a new way forward. Talks have been progressing with the Natural History Museum and Hampshire Cultural Trust to help bolster the visitor numbers and keep the attraction in Sandown.",
        "topic": "news",
        "id": "0d7194f62a4d095dd2807ad49feeb2a7"
    },
    {
        "headline": "Biometric Verification Softwares Market Key Vendors, Key Segment, Key Companies, Growth Opportunities by 2023 to 2029",
        "author": "",
        "published": 1683814642000,
        "blurb": "The Global Biometric Verification Softwares Market can be obtained through the market details such as growth drivers latest developments Biometric Verification Softwares market business strategies…",
        "story": "Press release Biometric Verification Softwares MarketThe Global Biometric Verification Softwares Market can be obtained through the market details such as growth drivers, latest developments, Biometric Verification Softwares market business strategies, regional study, and future market status. A detailed industry analysis supported by the sort and channel aids in understanding the trending product type and other potential variants.Get A Sample Copy of This Market Report: https://www.reportsnreports.",
        "topic": "business",
        "id": "801514102ec5c2a195e0ebaa743b6094"
    },
    {
        "headline": "Long-haul carrier Emirates launches $200M fund to reduce fossil fuel use in aviation",
        "author": "",
        "published": 1683814631000,
        "blurb": "We use cookies. By Clicking \"OK\" or any content on this site, you agree to allow cookies to be placed. Read more in our privacy policy.",
        "story": "DUBAI, United Arab Emirates (AP) — Long-haul carrier Emirates said Thursday it would create a $200 million fund for research and development projects aimed at reducing the use of fossil fuels in commercial aviation.Emirates made the announcement ahead of releasing their annual report for 2022.The airline, owned by Dubai's government, said the funding would be distributed over three years.'It's clear that with the current pathways available to airlines in terms of emissions reduction, our industry won't be able to hit net zero targets in the prescribed timeline,' airline President Tim Clark said in a statement.",
        "topic": "news",
        "id": "27691be3d8d48f98c2eae8e2651aefa3"
    },
    {
        "headline": "Fresenius Medical Care AG & Co. KGaA (NYSE:FMS) Stock Price Crosses Above Two Hundred Day Moving Average of $18.37",
        "author": "Tyrone Williams",
        "published": 1683814601000,
        "blurb": "Fresenius Medical Care AG & Co. KGaA (NYSE:FMS – Get Rating) crossed above its 200-day moving average during trading on Monday . The stock has a 200-day moving average of $18.37 and traded as high as…",
        "story": "Fresenius Medical Care AG & Co. KGaA (NYSE:FMS – Get Rating) crossed above its 200-day moving average during trading on Monday . The stock has a 200-day moving average of $18.37 and traded as high as $23.42. Fresenius Medical Care AG & Co. KGaA shares last traded at $23.20, with a volume of 709,057 shares trading hands. Analyst Upgrades and DowngradesSeveral equities research analysts have recently commented on the company. HSBC downgraded Fresenius Medical Care AG & Co. KGaA from a 'hold' rating to a 'reduce' rating in a report on Tuesday, March 7th.",
        "topic": "news",
        "id": "ab16419929368b0440a91b2ba8c16b15"
    },
    {
        "headline": "Indian Telcos Push for OTT Apps to Pay for 5G Infrastructure",
        "author": "Tanuja K",
        "published": 1683814560000,
        "blurb": "India's telecom companies are seeking a mechanism for OTT apps to pay for the creation of digital infrastructure in the country.",
        "story": "India's telecom companies are seeking a mechanism for OTT apps to pay for the creation of digital infrastructure in the country.The telcos will highlight the current global debate regarding fair share principles for OTTs.The telecom companies have drawn attention to ongoing consultations initiated by the European Commission and Brazil's telecoms regulator, Anatel. India's telecom companies are seeking a mechanism for OTT (over-the-top) apps to pay for the creation of digital infrastructure in the country.",
        "topic": "news",
        "id": "ba21d8d02d4b4cc2763402afe18596c0"
    },
    {
        "headline": "Temenos Expands Relationship With AWS To Offer Core Banking As SaaS",
        "author": "",
        "published": 1683814552000,
        "blurb": "Date 11/05/2023 Temenos (SIX: TEMN), has announced that its core banking solutions are now available as Software-as-a-Service (SaaS) further to Temenos' integration of its application on Amazon Web…",
        "story": "Date 11/05/2023 Temenos (SIX: TEMN), has announced that its core banking solutions are now available as Software-as-a-Service (SaaS) further to Temenos' integration of its application on Amazon Web Services AWS). With this, Temenos offers more choice to its clients as the Temenos Banking Cloud becomes one of the industry's most comprehensive SaaS solutions covering the broadest range of regional and governance requirements, data standards and certifications. Running Temenos Banking Cloud composable banking services on AWS enables retail, commercial and private banks – incumbents and challengers – to gain greater agility, higher performance, scalability, and security.",
        "topic": "news",
        "id": "2ddababde1d6f89bfe4da4fd37d7fd0c"
    },
    {
        "headline": "AGRANA expands production capacity for technical starches and invests € 23 million at Gmünd site",
        "author": "EQS Group AG",
        "published": 1683814503000,
        "blurb": "EQS-Media / 11.05.2023 / 10:15 CET/CEST AGRANA expands production capacity for technical starches and invests € 23 million at Gmünd site This year, the fruit, starch and sugar group AGRANA is starting…",
        "story": "EQS-Media / 11.05.2023 / 10:15 CET/CESTAGRANA expands production capacity for technical starches and invests € 23 million at Gmünd site This year, the fruit, starch and sugar group AGRANA is starting with the construction of an additional drum drying plant at the site of its potato starch mill in Gmünd (Waldviertel District of Lower Austria). With an investment volume of € 23 million, AGRANA aims to boost the production of technical special starches for the construction and adhesive sectors.",
        "topic": "news",
        "id": "3f17280214dc8846e768ff8d359414cd"
    },
    {
        "headline": "'We want to respect champions': McRae reveals role in Collingwood's Franklin statement",
        "author": "",
        "published": 1683814500000,
        "blurb": "'We want to respect champions of the game.'",
        "story": "Collingwood coach Craig McRae has responded to Magpies fans booing Sydney champion Lance Franklin in Sunday's win at the MCG.After Franklin was booed on occasion throughout the game, Sydney coach John Longmire expressed his confusion as to why he was being targeted.Following the incident, Collingwood, the AFL and Sydney all released statements coming out against the booing.McRae, club captain Darcy Moore and CEO Craig Kelly all signed the Collingwood statement and the coach says he simply wants fans to respect champions of the game.",
        "topic": "news",
        "id": "a5761c589390f9c282584d4d44ee206b"
    },
    {
        "headline": "Li Auto sees both quarterly revenue, deliveries hit new high in Q1 2023",
        "author": "",
        "published": 1683814500000,
        "blurb": "Shanghai (Gasgoo)- Chinese new energy vehicle startup Li Auto announced its first-quarter (Q1) 2023 financial results on May 10, revealing record-high quarterl",
        "story": "Shanghai (Gasgoo)- Chinese new energy vehicle startup Li Auto announced its first-quarter (Q1) 2023 financial results on May 10, revealing record-high quarterly revenue and delivery volume.In Q1 2023, Li Auto's total revenues reached RMB18.79 billion (US$2.74 billion), surging 96.5% year on year, while also rising 6.4% quarter on quarter.The Q1 2023 revenues from vehicle sales were RMB18.33 billion (US$2.67 billion), shooting up 96.9% over the previous year and growing 6.1% over the previous quarter.",
        "topic": "news",
        "id": "5fc1d2d265ae8d7ca75c5f05122f143e"
    },
    {
        "headline": "The 2023 Conflict In Sudan: A Visual Primer",
        "author": "Tyler Durden",
        "published": 1683814500000,
        "blurb": "...what exactly is happening in Sudan?",
        "story": "The African nation of Sudan has been in the headlines, as intense fighting has rocked the country.As this bloody power struggle plays out, the map infographic below from Visual Capitalist's Nick Routley and Bhabna Banerjee, aims to provides key information on the conflict, as well as general facts and context about the country.To begin, what exactly is happening in Sudan?The 2023 Conflict in Sudan: A PrimerAs explosions echo throughout Khartoum—Africa's sixth largest urban area—many around the world are left wondering how the conflict escalated to this point.",
        "topic": "news",
        "id": "df37858222c6734219781d2c6edbe3dc"
    },
    {
        "headline": "Nazareth Cinema Lady (2015)",
        "author": "",
        "published": 1683814500000,
        "blurb": "The story of Safaa Dabour, an observant Muslim woman from Nazareth, struggling to take charge of her own fate and freedom and to establish the first and only Arab cinematheque in Israel.",
        "story": "SynopsisThe story of Safaa Dabour, an observant Muslim woman from Nazareth, struggling to take charge of her own fate and freedom and to establish the first and only Arab cinematheque in Israel.",
        "topic": "entertainment",
        "id": "5af90c66e94612e4e25c444cffe32344"
    },
    {
        "headline": "Pivot Bio Launches 2023 N-Ovator Program",
        "author": "",
        "published": 1683814500000,
        "blurb": "The annual nitrogen credit program enables farmers to increase profitability while reducing their environmental impact.",
        "story": "Read More Read More Read More Read More Read More",
        "topic": "news",
        "id": "3e896d2d65ed928132a1b8f1b6dfc3c5"
    },
    {
        "headline": "Long-haul carrier Emirates sees highest-ever profit in 2022 of $2.9B after pandemic grounded flights",
        "author": "",
        "published": 1683814500000,
        "blurb": "DUBAI, United Arab Emirates (AP) — Long-haul carrier Emirates saw its most-profit year ever in 2022, earning $2.9 billion after bouncing back from the coronavirus pandemic shutting down global…",
        "story": "DUBAI, United Arab Emirates (AP) — Long-haul carrier Emirates saw its most-profit year ever in 2022, earning $2.9 billion after bouncing back from the coronavirus pandemic shutting down global aviation, the airline announced Thursday.The carrier's revival comes as Dubai, which owns the airline, has seen property prices skyrocket and people flood into the city-state in the United Arab Emirates as it lifted pandemic restrictions quickly and welcomed Russians fleeing Moscow's war on Ukraine.Emirates' annual report put revenue for the carrier at $29 billion in 2022, up 81% from 2021's figures of $16 billion.",
        "topic": "business",
        "id": "dcedbb5265ab70681ef83ea998f2aa9e"
    },
    {
        "headline": "Felix Schoeller unveils new transfer films for Fespa",
        "author": "Dominic Bernard",
        "published": 1683814500000,
        "blurb": "Specialty paper manufacturer Felix Schoeller has unveiled three new transfer films to be demonstrated at Fespa's Global Print Expo.",
        "story": "Dominic Bernard Thursday, May 4, 2023 Specialty paper manufacturer Felix Schoeller has unveiled three new transfer films to be demonstrated at Fespa's Global Print Expo. Developed in conjunction with polymer film manufacturer Bleher Folientechnik, the films – two for direct-to-fabric (DTF) application, and the other for screen printing with plastisol and water-based inks – follow on the heels of Schoeller's entrance into the transfer film market at Fespa 2022.The two transfer films, Transfer DTF Matt 110 and 135, with strengths of 80µm and 105µm respectively, will be available in 300 or 600mm widths.",
        "topic": "news",
        "id": "a48af52baaf76881ec1eae8aaa624d57"
    },
    {
        "headline": "Battle of Bakhmut: What's Really Going On?",
        "author": "Kyiv Post",
        "published": 1683814500000,
        "blurb": "After a successful Ukrainian counterattack, the battle of Bakhmut may be entering a new level of intensity and fluidity. Still, there are mixed reports about what is happening and what comes next.",
        "story": "What's likely to have happened?On May 10, a day-time assault was undertaken by the 3rd Separate Assault Brigade, an Azov movement unit within the Armed Forces of (AFU), on the outskirts of Bakhmut.A senior spokesperson for Azov, Andriy Biletsky, and the leader of PMC Wagner Group, Yevgeny Prigozhin, issued separate video statements essentially confirming that the assault had been successful. Having said that, Prigozhin may have used his statement to both leverage the Kremlin for more operational support and for more command control over the Bakhmut battlefield.",
        "topic": "news",
        "id": "d1a02a92eb5292f519939761ae738e05"
    },
    {
        "headline": "FlexTouch's Touch Sensors Now Available in Lenovo's Yoga 2-in-1 Laptops",
        "author": "itnewsonline",
        "published": 1683814500000,
        "blurb": "PR.com2023-05-11San Jose, CA May 11, 2023 --(PR.com)-- FlexTouch Technologies Co. (\"FlexTouch\"), a leading provider of metal mesh touch sensors for consumer electronics, automotive, and industrial…",
        "story": "PR.com2023-05-11San Jose, CA May 11, 2023 --(PR.com)-- FlexTouch Technologies Co. (\"FlexTouch\"), a leading provider of metal mesh touch sensors for consumer electronics, automotive, and industrial control devices, is pleased to announce that its touch sensors are now available in Lenovo's popular Yoga 2-in-1 laptop product series, which is available for purchase in retail stores across North America, Europe, and Asia. FlexTouch's copper-based metal mesh touch sensors offer a superior touch experience for laptops, such as the Lenovo Yoga 2-in-1 series, which can function as both a laptop and a tablet.",
        "topic": "news",
        "id": "2b341fac87202d23eac4286576c41aaa"
    },
    {
        "headline": "E-registration services via Sampark centres in Chandigarh",
        "author": "ET RealEstate",
        "published": 1683814500000,
        "blurb": "Chandigarh: The service shall facilitate city residents to pay property registration related fees at a nominal facilitation charge of Rs 40 (exclusive of taxes) per transaction at the Sampark centres.",
        "story": "The service shall facilitate city residents to pay property registration related fees at a nominal facilitation charge of Rs 40 (exclusive of taxes) per transaction at the Sampark centres. CHANDIGARH: The department of information technology, Chandigarh, in collaboration with Stock Holding Corporation of India Limited has introduced e-registration service through Sampark centres.The service shall facilitate city residents to pay property registration related fees at a nominal facilitation charge of Rs 40 (exclusive of taxes) per transaction at the Sampark centres.",
        "topic": "tech",
        "id": "010785a693da0918638bdefc5461d49c"
    },
    {
        "headline": "Salmon farmers welcome Scottish gov't deliberation on rural housing",
        "author": "Undercurrent News",
        "published": 1683814500000,
        "blurb": "Salmon Scotland wants to see the millions sent to Crown Estate Scotland directly ringfenced for coastal areas where farms operate instead",
        "story": "AdvertisementX Scotland wants to see the millions sent to Crown Estate Scotland directly ringfenced for coastal areas where farms operate insteadBy Undercurrent News | May 11, 2023 09:55 BST Loch Hourn salmon farm, Scotland. Credit: SSPO",
        "topic": "news",
        "id": "f7e85eefd418eea31d34881db84a08de"
    },
    {
        "headline": "Konkan board MHADA lottery declares winners of 4,640 flats",
        "author": "Nishikant Karlikar",
        "published": 1683814500000,
        "blurb": "The board received nearly 48,805 applications for the flats in - Thane, Palghar, Ratnagiri, Raigad and Sindhudurg districts by the Konkan board of MHADA.",
        "story": "The board received nearly 48,805 applications for the flats in - Thane, Palghar, Ratnagiri, Raigad and Sindhudurg districts by the Konkan board of MHADA. THANE: The Maharashtra housing board Mhada Lottery of Konkan board for 4,640 apartments and 14 plots was declared in Thane's Kashinath Ghanekar Auditorium on wednesday.The board received nearly 48,805 applications for the flats in - Thane, Palghar, Ratnagiri, Raigad and Sindhudurg districts by the Konkan board of MHADA.",
        "topic": "news",
        "id": "fab09767d242a36fb4a5409831e2509d"
    },
    {
        "headline": "How Europe is at the forefront of building artificial intelligence guardrails",
        "author": "Kelvin Chan",
        "published": 1683814500000,
        "blurb": "Authorities around the world are racing to draw up rules for artificial intelligence, including in the European Union, where draft legislation faced a pivotal moment. A European Parliament committee…",
        "story": "CountryUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia,",
        "topic": "news",
        "id": "7efda80889abd26bd2bf5aa53ed05f36"
    },
    {
        "headline": "EXCLUSIVE! Abhinav Kapoor opens up on Bade Achhe Lagte Hain 2 getting an EXTENSION, shares his plans on what he is up to after wrapping up the shoot and much more",
        "author": "Harmisha Chauhan Parikh",
        "published": 1683814500000,
        "blurb": "Abhinav Kapoor who plays the role of Vikrant opens up on Bade Achhe Lagte Hain 2 getting an extension and much more.",
        "story": "MUMBAI :The news about Bade Achhe Lagte Hain 2 wrapping up came as a huge shocker for the diehard fans.The show that was successfully running for a long time has finally reached its end.There were several rumours over the months that the show will be soon ending but now, finally, the day has come when Bade Achhe will bid adieu to the fans.However, a few days after the news about the show wrapping up, there came up another news that the show has got an extension. The news further read that the actors were once again called back to the sets to shoot for the show.",
        "topic": "entertainment",
        "id": "1481b46ecc517b18202e60ca94191096"
    },
    {
        "headline": "SSC tests depend on the impact of Cyclone Mocha",
        "author": "Staff Correspondent",
        "published": 1683814500000,
        "blurb": "As Cyclone Mocha nears, students sitting for their Secondary School Certificate and equivalent examinations in coastal districts are waiting to hear if their tests will be delayed.'We're yet to…",
        "story": "As Cyclone Mocha nears, students sitting for their Secondary School Certificate and equivalent examinations in coastal districts are waiting to hear if their tests will be delayed.'We're yet to receive any direction from the Inter-Education Board. We're waiting for the centre's decision,' said Cox's Bazar District Education Officer Md Nasir Uddin.He said the district administration was aware of the issue and already had a meeting with the education authorities. 'We were told to be on the alert.",
        "topic": "news",
        "id": "7154593556d28d85c2c90f79ca7043b2"
    },
    {
        "headline": "Alexander Lyons Solutions continues growth trajectory with new biotechnology recruitment division",
        "author": "Stuart Gentle",
        "published": 1683814500000,
        "blurb": "The new team will focus on supporting the hiring efforts of Clinical Development within cutting-edge Biotechnology companies and Global Pharmaceutical companies with a key strategic focus across the…",
        "story": "The new team will focus on supporting the hiring efforts of Clinical Development within cutting-edge Biotechnology companies and Global Pharmaceutical companies with a key strategic focus across the EU and Switzerland. Founded in 2011 by experienced recruitment consultant Alex Dick, ALS has built a reputation for its straight-talking, no-nonsense approach to recruitment. The establishment of the Biotech team signals the firm's expansion into multiple recruitment specialisms. Led by Managing Consultant, Paul Shaw, the Biotech team will focus on early-stage clinical development within both Pharma and Biotechnology (Phases II and III).",
        "topic": "news",
        "id": "6d166657540b8b91e61e8f657e3f288d"
    },
    {
        "headline": "Government Clanger Propels Wolfe Tones Classic Top Of The Pops",
        "author": "",
        "published": 1683814500000,
        "blurb": "Sung lustily and heartily by rebels the length and breath of this island, the Wolfe Tones rebel rouser 'Come out Ye Black and Tans' has climbed to the top of both the Irish and UK iTunes charts...",
        "story": "The WolfeTones. Official. Sung lustily and heartily by rebels the length and breath of this island, the Wolfe Tones rebel rouser ‘Come out Ye Black and Tans' has climbed to the top of both the Irish and UK iTunes charts afterv plans for a controversial commemoration of the Royal Irish Constabulary were shelved by the Government following widespread condemnation from far and wide.Several Independent ministers swiftly said that would not attend the event, while Fianna Fáil leader Micheál Martin said the event was an 'error in judgement' by the Government.",
        "topic": "politics",
        "id": "1769becd1a41ab861f54cba501986000"
    },
    {
        "headline": "\"Shinde must resign if he has any morality\": Uddhav Thackeray after SC verdict",
        "author": "",
        "published": 1683814500000,
        "blurb": "The Supreme Court today ruled that Uddhav Thackeray's government in Maharashtra can't be restored as the then Chief Minister had resigned on his own last year amid a huge drama that resulted in a…",
        "story": "ANI | Updated: May 11, 2023 14:55 IST Mumbai (Maharashtra) [India], May 11 (ANI): Former Maharashtra chief minister in his first reaction to Thursday's Supreme Court verdict on the face-off with his successor Eknath Shinde stated that the latter should step down on \"moral grounds\" alleging he \"murdered democracy\" to assume power.Noting that the apex court in its verdict stated that he would probably have been reinstated as chief minister had he not resigned from the post in 2022, Thackeray said he was not fighting for himself but for the people of Maharashtra.",
        "topic": "politics",
        "id": "368b772f8c9a5046c5db06dbb7dab95d"
    },
    {
        "headline": "DataArt Expands Global Footprint in Bangalore, India",
        "author": "DataArt via Business Wire",
        "published": 1683814500000,
        "blurb": "The initiative is part of the strategy to support the company's diversification to deliver exceptional customer service. DataArt, a global software engineering firm, announced today the opening of a…",
        "story": "The initiative is part of the strategy to support the company's diversification to deliver exceptional customer service. DataArt, a global software engineering firm, announced today the opening of a new R&D office in Bangalore. As DataArt continues to serve clients in the US, UK, Europe, and the Middle East, expanding in India represents a strategic move towards providing even better global coverage. The new presence will also meet the needs of its clients by expanding its reach in terms of skills, culture, time zones, and scale.",
        "topic": "finance",
        "id": "0eee8cfcfd5f30b542c358a844ef0754"
    },
    {
        "headline": "ICSE Result 2023 Date: ICSE Class 10 Result Likely To Be Announced Next Week At cisce.org- Check Latest Update Here",
        "author": "Zee Media Bureau",
        "published": 1683814500000,
        "blurb": "ICSE Class 10 Result 2023: As per reports, the ICSE Class 10 Result is expected to be declared next week. Once the ICSE Class 10th Result is declared, students will be able to check it on the official…",
        "story": "ICSE Board Result 2023: Council for Indian School Certificate Examinations, CISCE is expected to declare the ICSE Result 2023 soon on the official website. According to reports, the ICSE Class 10 Result will be released next week. Students will be able to check their ICSE Class 10th Result on the official website - cisce.org - after it is released. According to reports, the ICSE Class 10 Result would be released after May 10, 2023.ICSE Board Result 2023: Where to check resultStudents will be able to view the ICSE Result 2023 on the official website, cisce.",
        "topic": "economics",
        "id": "088184ec7a22dfa4caf7632060a343a2"
    },
    {
        "headline": "New Biopic On The Final Years Of Amy Winehouse In The Works",
        "author": "Dalton Mac Namee",
        "published": 1683814500000,
        "blurb": "A new biopic on the final years of Amy Winehouse is reportedly in the works. Produced by Halcyon Studios, the biopic is based on Daphne Barak's book Saving Amy. On the biopic, the studios' CEO...",
        "story": "A new biopic on the final years of Amy Winehouse is reportedly in the works.Produced by Halcyon Studios, the biopic is based on Daphne Barak's book Saving Amy.On the biopic, the studios' CEO David Ellender said, 'Our team is honoured to be working on this project. Although her career was cut far too short, Amy was the voice of a generation and we look forward to telling her story in the most poignant way possible'. Advertisement When writing Saving Amy, Barak collated 40 hours of footage, photos and notes she put together with the singer and her family for the final years of her life.",
        "topic": "music",
        "id": "79741a953305c5dae256592be4193a9f"
    },
    {
        "headline": "USDA Announces New Steps to Enhance Organic Markets and Support Producers",
        "author": "",
        "published": 1683814500000,
        "blurb": "USDA Announces New Steps to Enhance Organic Markets and Support Producers",
        "story": "Agriculture Secretary Tom Vilsack has announced that the U.S. Department of Agriculture (USDA) is taking additional steps as part of its commitment to strengthen the market for domestically grown organic goods, and to support producers seeking organic certification. These funding opportunities are part of the U.S. Department of Agriculture's (USDA) Organic Transition Initiative, launched in fall 2022, which is a suite of offerings to help existing organic farmers and those transitioning to organic production and processing.",
        "topic": "news",
        "id": "8f678535378c6ff314ad555b2937d434"
    },
    {
        "headline": "TechnipFMC Wins Major Contract for SURF System Offshore Brazil",
        "author": "Oe Staff",
        "published": 1683814500000,
        "blurb": "Oilfield services firm TechnipFMC has won a contract to supply subsea umbilicals, risers, and flowlines (SURF) for the recently sanctioned…",
        "story": "©Equinor Oilfield services firm TechnipFMC has won a contract to supply subsea umbilicals, risers, and flowlines (SURF) for the recently sanctioned $9 billion BM-C-33 offshore development in Brazil.The contract was awarded by Equinor, the operator of the offshore block, on behalf of its partners Repsol Sinopec Brasil and Petrobras.Located in the Campos Basin, BM-C-33 comprises three different pre-salt discoveries – Pão de Açúcar, Gávea and Seat – containing natural gas and oil/condensate recoverable reserves above one billion barrels of oil equivalent.",
        "topic": "news",
        "id": "feeac0bb58c266cfe6ab0379f318f800"
    },
    {
        "headline": "Arvind Kejriwal to meet Delhi LG following SC verdict",
        "author": "",
        "published": 1683814500000,
        "blurb": "Kejriwal had sought time from the LG after Supreme Court ruled that the Delhi government has legislative powers over administrative services in the national capital.",
        "story": "ANI | Updated: May 11, 2023 14:58 IST New [India], May 11 (ANI): Chief Minister Arvind Kejriwal will meet Lieutenant Governor Vinai Kumar Saxena on Thursday at around 4 pm, hours after Supreme Court's verdict in a drawn-out tussle for power between his government and the Centre.Kejriwal had sought time from the LG after Supreme Court ruled that the government has legislative powers over administrative services in the national capital.The CM had also called a meeting of his ministers today after the Supreme Court's verdict.",
        "topic": "politics",
        "id": "1176a4a200da73ec193b6fe1084e9b28"
    },
    {
        "headline": "\"Bare Bones: Uncovering Your Innermost Artistic Expression\"",
        "author": "",
        "published": 1683814500000,
        "blurb": "Internationally known teaching artist Anne Siems is your guide in this weekend workshop. \"Working on paper with pencil, ink, charcoal, and watercolor, we allow ourselves to uncover the skeleton of our…",
        "story": "Posted Friday, May 5, 2023 9:49 am by Northwind Art Internationally known teaching artist Anne Siems is your guide in this weekend workshop. \"Working on paper with pencil, ink, charcoal, and watercolor, we allow ourselves to uncover the skeleton of our deeper artistic voice. Too often we hide behind color, texture, and material,\" she writes. \"We will explore working large, light, and with a bare-bones approach. Surrealist play, working with poetry, and portraiture will be part of our new tool kit.",
        "topic": "news",
        "id": "438574a97104da8f261cd0a307a294d9"
    },
    {
        "headline": "Economic Stability paving way for Presidential Polls",
        "author": "Best deals on hotels",
        "published": 1683814500000,
        "blurb": "Sri Lanka's political story has never been short of twists and turns, especially since last year when a leader elected with a resounding majority, Gotabaya Rajapaksa, resigned paving the way for a…",
        "story": "Sri Lanka's political story has never been short of twists and turns, especially since last year when a leader elected with a resounding majority, Gotabaya Rajapaksa, resigned paving the way for a nominated Parliamentarian, Ranil Wickremesinghe, to replace him. That drama is now set to continue.There was some quiet on the political front last week as the nation celebrated Vesak. These were the first fully fledged Vesak celebrations in five years. Celebrations in 2019 were dampened by the Easter attacks, in the next two years due to the pandemic and last year due to the economic crisis.",
        "topic": "economics",
        "id": "df0a6e2740c726514438cbc5a094b471"
    },
    {
        "headline": "Kyiv Post Morning Memo – Everything You Need to Know on Thursday, May 11",
        "author": "Kyiv Post",
        "published": 1683814500000,
        "blurb": "Your daily news brief direct from Ukraine's capital.",
        "story": "Good morning, Kyiv Post readers. Here's your Morning Memo for May 11 to get you up to speed on events in :· Latest Headlines· Military Situation Report· President Zelensky's Message· Quote of the Day· Pic of the DayHeadlines1. After a Ukrainian counterattack yesterday by Azov's 3rd Separate Assault Brigade on its southwestern outskirts, the battle of Bakhmut appears at a new level of intensity and fluidity. However, there are mixed reports about what may happen next.",
        "topic": "news",
        "id": "c3c73dd8e754f6fcf46966077976363a"
    },
    {
        "headline": "Top Recruitment Agency Robbert Murray & Associates celebrates Double Triumph, wins Best Boutique Executive & Recruitment Agency 2023 Award and Reward",
        "author": "",
        "published": 1683814500000,
        "blurb": "Submitted by Creativemediahouse on Thu, 05/11/2023 - 02:47 Robbert Murray, a renowned executive and recruitmen",
        "story": "Submitted by Creativemediahouse on Thu, 05/11/2023 - 02:47 Robbert Murray, a renowned executive and recruitment agency, has recently been honored with not one but two prestigious awards in the recruitment industry. Dubai, Dubai, United Arab Emirates., May 11, 2023 - /PressReleasePoint/ - [■ The company has been distinguished with the honour of Best Boutique Executive & Recruitment Agency 2023 – Middle East and the Reward of Excellence as talent leaders in the region. Winning the Best Boutique Executive & Recruitment Agency 2023 Award is a testament to the company's exceptional services in executive recruitment, talent acquisition and HR consulting.",
        "topic": "news",
        "id": "36d757663291289de15d0924c6c46fa7"
    },
    {
        "headline": "Suspect in Natalee Holloway disappearance faces extradition to US on fraud charges",
        "author": "The Associated Press",
        "published": 1683814500000,
        "blurb": "LIMA, Peru (AP) — Peru's government will allow the extradition to the United States of the prime suspect in the unsolved 2005 disappearance of American student Natalee Holloway on the Dutch Caribbean…",
        "story": "LIMA, Peru (AP) — Peru's government will allow the extradition to the United States of the prime suspect in the unsolved 2005 disappearance of American student Natalee Holloway on the Dutch Caribbean Island of Aruba, bringing her family hope there will be justice in the case. Dutch citizen Joran van der Sloot will face trial on extortion and wire fraud charges, stemming from an accusation that he tried to extort the Holloway family after their daughter's disappearance. Holloway, who lived in suburban Birmingham, Alabama, was 18 when she was last seen during a trip with classmates to Aruba.",
        "topic": "world",
        "id": "a74af29c140f936002c9e5a7fe572bce"
    },
    {
        "headline": "EXPLAINED: Donald Trump Refuses to Back Ukraine, Claims He Can Bring Peace ‘In 24 Hours'",
        "author": "Chris York",
        "published": 1683814500000,
        "blurb": "The former US president also refused to say if he believes Russian President Putin is a war criminal, saying it was ‘something to be discussed at a later day.'",
        "story": "Donald Trump has continued his long-held position of refusing to say a bad word about Russian President Vladimir Putin, declining to say if he wants or Russia to win the war. What did he say? 'I don't think in terms of winning and losing. I think in terms of getting it settled,' Trump said in a CNN town hall before a live audience in the state of New Hampshire. 'I want everybody to stop dying. They're dying. Russians and Ukrainians. I want them to stop dying. And I'll have that done,' Trump said, opposing the establishment Republican policy of backing Kyiv.",
        "topic": "world",
        "id": "fc0227a0c3141737837c4a335f3b560e"
    },
    {
        "headline": "Shamsudeen Mohamed Yunus",
        "author": "",
        "published": 1683814500000,
        "blurb": "What's your work experience? Your experience is one of the most important sections in a CV. List all relevant responsibilities, skills, projects, and achievements against each role. If you're a fresh…",
        "story": "What's your work experience? Your experience is one of the most important sections in a CV. List all relevant responsibilities, skills, projects, and achievements against each role. If you're a fresh grad, you can add any volunteer work or any internship you've done before. Add Experience Total Years of Experience: 16 Years, 3 Months March 2011 To March 2023 I found this job using Bayt.com at Al Yusr Industrial Contracting Co. Location : Saudi Arabia Employee's attendance timesheet control with project.",
        "topic": "news",
        "id": "b2381c41b48fb874d42930bb1df96d0c"
    },
    {
        "headline": "Turkey Election: A Real Challenge To Erdogan's Rule",
        "author": "Tyler Durden",
        "published": 1683814500000,
        "blurb": "The most contentious election fight of Erdogan's career & he is pulling out all the stops...",
        "story": "'One should bear in mind that there is nothing more difficult to execute, nor more dubious of success, nor more dangerous to administer, than to introduce new political orders. For the one who introduces them has as his enemies all those who profit from the old order, and he has only lukewarm defenders in all those who might profit from the new order.'- Machiavelli [The Prince, VI]Introduction: Two Paths for a Nation on Two ContinentsThe first round of the Turkish Presidential elections are on Sunday, May 14th, Erdogan having chosen to call early elections instead of holding them during the general election in June.",
        "topic": "news",
        "id": "eb00f3a9d4a16db43c873791d40bfe5c"
    },
    {
        "headline": "Economic Watch: China's Zhejiang strives to boost trade ties with central, eastern European countries",
        "author": "",
        "published": 1683814500000,
        "blurb": "HANGZHOU, May 11 (Xinhua) -- A permanent pavilion in the Ningbo International Conference & Exhibition Center is drawing a steady stream of visitors, showcasing specialty products such as roses,…",
        "story": "HANGZHOU, May 11 (Xinhua) -- A permanent pavilion in the Ningbo International Conference & Exhibition Center is drawing a steady stream of visitors, showcasing specialty products such as roses, crystals, and wines from Central and Eastern European Countries (CEECs). According to Chen Yi, general manager of Ningbo Dijia VIDA Trading Co., Ltd., her booths distinguish themselves with an extensive selection of products from Poland. It is the first trading company to set up booths in the pavilion, located in the city of Ningbo in Zhejiang Province, an economic powerhouse in east China.",
        "topic": "news",
        "id": "50a680849b00c9f7cdcb407d2e617a9f"
    },
    {
        "headline": "‘One small step' left for Inzaghi's Champions League final dream",
        "author": "Please Enter Your Name Here",
        "published": 1683814500000,
        "blurb": "MILAN: Simone Inzaghi can already see his Inter Milan team in next month's Champions League final after an impressive 2-0 win over local rivals AC Milan in the last four on Wednesday.Inter need to",
        "story": "MILAN, ITALY - MAY 10: Simone Inzaghi Head coach of FC Internazionale reacts during the UEFA Champions League semi-final first leg match between AC Milan and FC Internazionale at San Siro on May 10, 2023 in Milan, Italy. (Photo by Jonathan Moscrop/Getty Images) MILAN: Simone Inzaghi can already see his Inter Milan team in next month's Champions League final after an impressive 2-0 win over local rivals AC Milan in the last four on Wednesday.Inter need to avoid a collapse in the second leg of their all-Italian tie in order to reach a clash with either Real Madrid or Manchester City in Istanbul.",
        "topic": "news",
        "id": "e02e106101c802c3c2dc4c6d126515a8"
    },
    {
        "headline": "Vast improvement in processing arm gives SalMar strong start to 2023",
        "author": "Neil Ramsden",
        "published": 1683814500000,
        "blurb": "As a salmon farmer, the Norwegian firm enjoyed high raw material prices, but boosting its bottom line was the fact that its processing EBIT improved from NOK -372m to NOK -81m",
        "story": "AdvertisementXAs a salmon farmer, the Norwegian firm enjoyed high raw material prices, but boosting its bottom line was the fact that its processing EBIT improved from NOK -372m to NOK -81mBy Neil Ramsden | May 11, 2023 10:03 BST SalMar's deal for NTS overshadowed much of 2022, ultimately proving of the largest buyouts ever seen in the Norwegian salmon sector",
        "topic": "news",
        "id": "b4c77e51d631187c0b6c21a89aa7186e"
    },
    {
        "headline": "Raise Awareness of Post-Traumatic Growth During June's PTSD Awareness Month",
        "author": "Shadow Media Group",
        "published": 1683814500000,
        "blurb": "Shadow Media Group Presents Short Documentary Pre-screening + Panel Q&A Journalists and content creators are invited to be part of a North American initiative to raise awareness about the potential…",
        "story": "Shadow Media Group Presents Short Documentary Pre-screening + Panel Q&A Journalists and content creators are invited to be part of a North American initiative to raise awareness about the potential for growth and transformation that can emerge from adversity. As we recognize Post-Traumatic Growth during June's PTSD Awareness Month, we are reminded that post-traumatic growth can be a powerful tool in raising awareness around the importance of mental health and personal growth in the face of trauma.",
        "topic": "finance",
        "id": "d905a3943a00396e12ee048e3609db96"
    },
    {
        "headline": "Tre'vell Anderson on ‘Legally Blonde'",
        "author": "",
        "published": 1683814500000,
        "blurb": "The newly minted authoress talks about the fabulous, underestimated, and unapologetic Elle Woods",
        "story": "Episode notesElle Woods is an iconic character, but not an obvious one from Tre'vell Anderson, author of the new book, We See Each Other: A Black. Trans Journey Through TV and Film. Leave it to the effervescent Tre'vell to bring their signature FANTI gray-area mindset to their character choice! In this episode, Tre'vell and Jordan look at what it is about Elle Woods that offered Tre'vell a glimpse of what they could be…and consider if future generations of Black, trans folks might be able to feel seen without much mental gymnastics.",
        "topic": "news",
        "id": "d8fb7e45d53e05e14c08628da6609bac"
    },
    {
        "headline": "MUST READ! Katha Ankahee's Aditi Dev Sharma meets This Kundali Bhagya star, check out what happened",
        "author": "Sanjana Parekh",
        "published": 1683814500000,
        "blurb": "Aditi and Shraddha have known each other for a while now and were together in Cinestars Ki Khoj, of which Katha was the winner. Both Aditi and Shraddha have been part of many movies and TV shows and…",
        "story": "MUMBAI :Tellychakkar is back with yet another story from the tellyworld. We always like to be at the forefront of delivering stories and news to our readers and keep them updated and entertained with the happenings around Tinsel Town.Also read: Kundali Bhagya: Aww! Preeta's motherly love and care to change Shaurya's heartKundali Bhagya is a show that has been amongst the most popular and loved shows of all time. The pair of Dheeraj Dhoopar and Shraddha Arya was loved by the audience and after Dheeraj quit the show last year, Shakti Arora entered the show.",
        "topic": "entertainment",
        "id": "6a87073a840f79833f018aa2cd242457"
    },
    {
        "headline": "Palestinian Dies of Wounds Sustained the Previous Day in Jenin Invasion",
        "author": "",
        "published": 1683814500000,
        "blurb": "A young man identified as Aws Jamal Hamamda Kamil, 30 years old, died from serious wounds he suffered Wednesday, killed on Thursday after having been shot by the Israeli occupation forces during their…",
        "story": "A young man identified as Aws Jamal Hamamda Kamil, 30 years old, died from serious wounds he suffered Wednesday, killed on Thursday after having been shot by the Israeli occupation forces during their raid Wednesday on the town of Qabatia, south of Jenin.The director of Al-Razi Hospital, Fawaz Hammad, told the Palestinian Wafa news agency that the young Hamamdeh was admitted to the hospital yesterday in a very critical condition, as live bullets hit him in the abdomen and chest.Despite the best efforts of the medical teams at the Al-Razi Hospital, they were unable to save his life.",
        "topic": "news",
        "id": "c0f421bde0514d60ca2c0a71ef0d9478"
    },
    {
        "headline": "Shell Pilipinas optimistic on recovery despite net loss",
        "author": "",
        "published": 1683814500000,
        "blurb": "Listed Shell Pilipinas Corp. seeks to prop up its recovery momentum with a multibillion-peso investment this year, as volatility in the oil market led to losses for the company in the first quarter.",
        "story": "Metro Manila (CNN Philippines, May 11) — Listed Shell Pilipinas Corp. seeks to prop up its recovery momentum with a multibillion-peso investment this year, as volatility in the oil market led to losses for the company in the first quarter. In a filing to the stock exchange Wednesday, the oil giant said it \"intends to invest ₱5 billion to ₱6 billion this year,\" the bulk of which is to increase its mobility stations nationwide. \"Aside from opening new mobility sites, SHLPH will also revamp some of its existing sites to provide non-fuels retail offers such as lube bays, Shell Select convenience stores, Shell Cafe, among others,\" it added.",
        "topic": "business",
        "id": "3999c681a09d9d37fad54396841ce472"
    },
    {
        "headline": "Volvo Cars unveils new design studio in Shanghai",
        "author": "",
        "published": 1683814500000,
        "blurb": "Shanghai (Gasgoo)- On May 10, Volvo Cars unveiled its new design studio in Shanghai, one of the mega cities in Asia, meaning the automaker's global design foot",
        "story": "Shanghai (Gasgoo)- On May 10, Volvo Cars unveiled its new design studio in Shanghai, one of the mega cities in Asia, meaning the automaker's global design footprint has been further expanded in addition to its existing studios in Gothenburg and Camarillo.The 5,500-square-meter studio provides top-notch space for more than 100 designers and creative engineers. Mirroring the carmaker's design headquarters in Gothenburg, the Shanghai studio has all the functions required to facilitate the whole design process, with the capabilities of offering interior, exterior, color and material, as well as UX design to full-sized mass-produced models.",
        "topic": "news",
        "id": "655e732714f7a3a76e35886adbc553a2"
    }
]